[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/fH9nkt4/book-Mooking-bird.jpg",
    "review": "To Kill a Mockingbird is a classic novel that delves into profound issues of racial injustice, societal inequality, and moral growth in a small Southern town. Through the eyes of Scout Finch, the young daughter of lawyer Atticus Finch, readers are taken on a journey that challenges deeply ingrained prejudices and confronts the harsh realities of bigotry and discrimination. Set against the backdrop of the 1930s, during a time of deep-seated racial tensions in America, Harper Lee masterfully crafts a narrative that not only captures the essence of a particular moment in history but also resonates with timeless themes of compassion, empathy, and the search for justice.",
    "totalPages": 281,
    "rating": 4.5,
    "categories": "Fiction",
    "tags": ["Drama", "Social Issues", "Legal Drama"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/VwfnmkV/book-1984.jpg",
    "review": "1984 is a dystopian masterpiece that explores the darkest corners of totalitarianism, surveillance, and the erosion of individual freedoms. George Orwell paints a chilling portrait of a society governed by omnipresent government surveillance, thought control, and the manipulation of truth. Set in a bleak future where Big Brother reigns supreme, the novel follows Winston Smith, a disillusioned bureaucrat who dares to challenge the oppressive regime. As Winston embarks on a dangerous journey of self-discovery and rebellion, readers are confronted with profound questions about power, truth, and the nature of humanity.",
    "totalPages": 328,
    "rating": 4.7,
    "categories": "Science Fiction",
    "tags": ["Dystopian", "Political", "Surveil"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 3,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/ZG3pcmj/book-pride.jpg",
    "review": "Pride and Prejudice is a timeless romantic saga that transcends generations with its wit, charm, and astute social commentary. Jane Austen, with her keen observational skills and sharp wit, paints a vivid portrait of Georgian society, where class and marriage are inextricably linked. At its heart, the novel follows the tumultuous relationship between the spirited Elizabeth Bennet and the enigmatic Mr. Darcy, as they navigate the complexities of love, pride, and societal expectations. With its memorable characters, sparkling dialogue, and enduring themes of love and self-discovery, Pride and Prejudice continues to captivate readers worldwide.",
    "totalPages": 279,
    "rating": 4.6,
    "categories": "Romance",
    "tags": ["Classic", "Regency", "Love Story"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 4,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/j8xdg5m/book-Thegreat.jpg",
    "review": "The Great Gatsby is a quintessential American novel that encapsulates the decadence, disillusionment, and elusive pursuit of the American Dream in the Jazz Age. F. Scott Fitzgerald weaves a tragic tale of love, longing, and betrayal against the glittering backdrop of 1920s New York. Through the eyes of narrator Nick Carraway, readers are drawn into the extravagant world of Jay Gatsby, a mysterious millionaire with a passion for the enigmatic Daisy Buchanan. As Gatsby's obsession with the past collides with the realities of the present, Fitzgerald masterfully explores themes of wealth, ambition, and the corrupting influence of materialism.",
    "totalPages": 180,
    "rating": 4.4,
    "categories": "Fiction",
    "tags": ["Classic", "Literature", "Wealth"],
    "publisher": "Charles Scribner s Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/DDpr8tR/book-Thecather.jpg",
    "review": "The Catcher in the Rye is a seminal work of American literature that explores the existential angst and alienation of adolescence with unparalleled authenticity and insight. J.D. Salinger's protagonist, Holden Caulfield, has become an iconic symbol of teenage rebellion and disillusionment, resonating with readers across generations. Through Holden's cynical yet vulnerable voice, Salinger navigates themes of identity, authenticity, and the search for meaning in a world seemingly devoid of sincerity. With its raw emotional honesty and unflinching portrayal of adolescent turmoil, The Catcher in the Rye remains as relevant and impactful today as it was upon its publication.",
    "totalPages": 224,
    "rating": 4.3,
    "categories": "Fiction",
    "tags": ["Coming-of-Age", "Modern Classic"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "Harry Potter and the Sorcerer s Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/xYZS5DR/book-Harry-Potter-and-the-Sorcerer-s-Stone.jpg",
    "review": "Harry Potter and the Sorcerer's Stone is a captivating tale of magic, friendship, and the power of good triumphing over evil. J.K. Rowling introduces readers to the enchanting world of Hogwarts School of Witchcraft and Wizardry, where young Harry Potter discovers his true identity as a wizard and embarks on a journey of self-discovery. Alongside his loyal friends Ron and Hermione, Harry navigates the challenges of school life while uncovering dark secrets about his past and the mysterious Sorcerer's Stone. With its richly imagined universe, endearing characters, and timeless themes of bravery and loyalty, Harry Potter and the Sorcerer's Stone has become a beloved classic cherished by readers of all ages.",
    "totalPages": 309,
    "rating": 4.8,
    "categories": "Fantasy",
    "tags": ["Magic", "Children's Literature"],
    "publisher": "Bloomsbury Publishing",
    "yearOfPublishing": 1997
    },
    {
    "bookId": 7,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/2cD7HWT/book-thehobiitjpg.jpg",
    "review": "The Hobbit is an enchanting adventure that transports readers to the wondrous realm of Middle-earth, where unlikely heroes embark on a perilous quest of discovery and redemption. J.R.R. Tolkien's timeless tale follows the humble hobbit Bilbo Baggins as he is recruited by the wizard Gandalf to accompany a band of dwarves on a quest to reclaim their lost kingdom and treasure from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, goblins, and other fantastical creatures, testing his courage and resourcefulness at every turn. With its richly detailed world-building, captivating storytelling, and profound themes of courage and friendship, The Hobbit continues to captivate readers of all ages and inspire generations of fantasy lovers.",
    "totalPages": 310,
    "rating": 4.6,
    "categories": "Fantasy",
    "tags": ["Adventure", "Epic", "Quest"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
    },
    {
    "bookId": 8,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/8dRRr4y/thdavinci.jpg",
    "review": "The Da Vinci Code is a riveting thriller that blends art, history, and mystery into a gripping narrative that keeps readers on the edge of their seats until the very last page. Dan Brown's novel follows symbologist Robert Langdon as he finds himself embroiled in a deadly race against time to solve a murder and unravel a centuries-old secret that could shake the foundations of Christianity. From the halls of the Louvre to the ancient streets of Rome, Langdon and cryptologist Sophie Neveu follow a trail of clues left by Leonardo da Vinci, encountering secret societies, hidden messages, and shocking revelations along the way. With its intricate plot, relentless pacing, and thought-provoking themes, The Da Vinci Code is a true page-turner that leaves readers questioning everything they thought they knew.",
    "totalPages": 590,
    "rating": 4.1,
    "categories": "Mystery",
    "tags": ["Conspiracy", "Adventure"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
    },
    {
    "bookId": 9,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/L5MHgNH/book-thelordofring.jpg",
    "review": "The Lord of the Rings is an epic fantasy saga that transports readers to a world of magic, adventure, and heroism on an unprecedented scale. J.R.R. Tolkien's magnum opus follows the quest to destroy the One Ring and defeat the Dark Lord Sauron before he plunges Middle-earth into eternal darkness. From the idyllic Shire to the fiery depths of Mount Doom, Frodo Baggins and a fellowship of diverse companions embark on a perilous journey fraught with danger and despair. Along the way, they face formidable foes, forge unlikely alliances, and discover the true meaning of sacrifice and valor. With its rich mythology, intricate languages, and profound themes of courage and redemption, The Lord of the Rings stands as a towering achievement in the realm of fantasy literature.",
    "totalPages": 1178,
    "rating": 4.9,
    "categories": "Fantasy",
    "tags": ["Epic", "Fantasy", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1954
    },
    {
    "bookId": 10,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.ibb.co/bH9Rm75/Hunger-Games-Poster.jpg",
    "review": "The Hunger Games is a gripping dystopian tale that explores the darkest depths of human nature while offering a glimmer of hope in the face of adversity. Suzanne Collins' novel introduces readers to the nation of Panem, where the Capitol holds absolute power over twelve impoverished districts. Each year, as a reminder of their subjugation, the Capitol hosts the Hunger Games, a televised spectacle where children from each district are forced to fight to the death. Amidst this brutal arena, Katniss Everdeen emerges as a beacon of resistance, defying the Capitol's tyranny and sparking a revolution that will change Panem forever. With its thrilling action, complex characters, and thought-provoking social commentary, The Hunger Games is a compelling read that resonates with readers of all ages.",
    "totalPages": 374,
    "rating": 4.5,
    "categories": "Young Adult",
    "tags": ["Dystopian", "Adventure"],
    "publisher": "Scholastic Press",
    "yearOfPublishing": 2008
    }
    ]
    
    
